NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l05/nrf54l05_flpr_peripherals.h
#define P0_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P0_CTRLSEL_MAP2 1                            /*!< (unspecified)                                                        */
#define P0_CTRLSEL_MAP3 0                            /*!< (unspecified)                                                        */
#define P0_CTRLSEL_MAP4 0                            /*!< (unspecified)                                                        */
#define P0_CTRLSEL_MAP5 0                            /*!< (unspecified)                                                        */
#define P0_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P0_PIN_NUM_MAX 6                             /*!< (unspecified)                                                        */
#define P0_PIN_NUM_SIZE 7                            /*!< (unspecified)                                                        */
#define P0_FEATURE_PINS_PRESENT 127                  /*!< (unspecified)                                                        */
#define P0_FEATURE_I5_LIBRARY 0                      /*!< (unspecified)                                                        */
#define P0_PIN_SENSE_MECHANISM 1                     /*!< I/O pins on this port have pin sense mechanism                       */
#define P0_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P0_WEAKPU 0                                  /*!< (unspecified)                                                        */
#define P0_RETAIN 0                                  /*!< (unspecified)                                                        */
#define P0_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P0_SLEWMODE 0                                /*!< (unspecified)                                                        */
#define P0_PULLSTR 0                                 /*!< (unspecified)                                                        */
#define P0_SUPPORT_1V2 0                             /*!< (unspecified)                                                        */
#define P0_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P0_BIASCTRL 0                                /*!< (unspecified)                                                        */
#define P0_PHASEPOLARITY 0                           /*!< (unspecified)                                                        */

/*Control access port*/
#define CTRLAPPERI_PRESENT 1
#define CTRLAPPERI_COUNT 1

/*Trace and debug control*/
#define TAD_PRESENT 1
#define TAD_COUNT 1

#define TAD_TADFORCEON 0                             /*!< (unspecified)                                                        */
#define TAD_TAD_HAS_TASKS 0                          /*!< (unspecified)                                                        */
#define TAD_PDREQCLR 1                               /*!< (unspecified)                                                        */
#define TAD_TAD_HAS_DBGWAKEUPREQ 1                   /*!< (unspecified)                                                        */
#define TAD_TAD_HAS_TWO_TPIUS 0                      /*!< (unspecified)                                                        */
#define TAD_HAS_ENABLE_REG 1                         /*!< (unspecified)                                                        */
#define TAD_HAS_TRACEPORTSPEED_REG 1                 /*!< (unspecified)                                                        */

/*Timer/Counter*/
#define TIMER_PRESENT 1
#define TIMER_COUNT 7

#define TIMER00_CC_NUM_MIN 0                         /*!< (unspecified)                                                        */
#define TIMER00_CC_NUM_MAX 5                         /*!< (unspecified)                                                        */
#define TIMER00_CC_NUM_SIZE 6                        /*!< (unspecified)                                                        */
#define TIMER00_MAX_SIZE_MIN 0                       /*!< (unspecified)                                                        */
#define TIMER00_MAX_SIZE_MAX 31                      /*!< (unspecified)                                                        */
#define TIMER00_MAX_SIZE_SIZE 32                     /*!< (unspecified)                                                        */
#define TIMER00_PCLK_MHZ 128                         /*!< Peripheral clock frequency (PCLK) is 128 MHz                         */
#define TIMER00_PCLK_VARIABLE 1                      /*!< The system is able to configure the TIMER peripheral input clock
                                                          frequency (PCLK) before it reaches TIMER, and calculations of
                                                          PRESCALER value must take the actual PCLK frequency into account*/
#define TIMER00_SHUTDOWN_TASK 0                      /*!< (unspecified)                                                        */

#define TIMER10_CC_NUM_MIN 0                         /*!< (unspecified)                                                        */
#define TIMER10_CC_NUM_MAX 7                         /*!< (unspecified)                                                        */
#define TIMER10_CC_NUM_SIZE 8                        /*!< (unspecified)                                                        */
#define TIMER10_MAX_SIZE_MIN 0                       /*!< (unspecified)                                                        */
#define TIMER10_MAX_SIZE_MAX 31                      /*!< (unspecified)                                                        */
#define TIMER10_MAX_SIZE_SIZE 32                     /*!< (unspecified)                                                        */
#define TIMER10_PCLK_MHZ 32                          /*!< Peripheral clock frequency (PCLK) is 32 MHz                          */
#define TIMER10_PCLK_VARIABLE 0                      /*!< (unspecified)                                                        */
#define TIMER10_SHUTDOWN_TASK 0                      /*!< (unspecified)                                                        */

#define TIMER20_CC_NUM_MIN 0                         /*!< (unspecified)                                                        */
#define TIMER20_CC_NUM_MAX 5                         /*!< (unspecified)                                                        */
#define TIMER20_CC_NUM_SIZE 6                        /*!< (unspecified)                                                        */
#define TIMER20_MAX_SIZE_MIN 0                       /*!< (unspecified)                                                        */
#define TIMER20_MAX_SIZE_MAX 31                      /*!< (unspecified)                                                        */
#define TIMER20_MAX_SIZE_SIZE 32                     /*!< (unspecified)                                                        */
#define TIMER20_PCLK_MHZ 16                          /*!< Peripheral clock frequency (PCLK) is 16 MHz                          */
#define TIMER20_PCLK_VARIABLE 0                      /*!< (unspecified)                                                        */
#define TIMER20_SHUTDOWN_TASK 0                      /*!< (unspecified)                                                        */

#define TIMER21_CC_NUM_MIN 0                         /*!< (unspecified)                                                        */
#define TIMER21_CC_NUM_MAX 5                         /*!< (unspecified)                                                        */
#define TIMER21_CC_NUM_SIZE 6                        /*!< (unspecified)                                                        */
#define TIMER21_MAX_SIZE_MIN 0                       /*!< (unspecified)                                                        */
#define TIMER21_MAX_SIZE_MAX 31                      /*!< (unspecified)                                                        */
#define TIMER21_MAX_SIZE_SIZE 32                     /*!< (unspecified)                                                        */
#define TIMER21_PCLK_MHZ 16                          /*!< Peripheral clock frequency (PCLK) is 16 MHz                          */
#define TIMER21_PCLK_VARIABLE 0                      /*!< (unspecified)                                                        */
#define TIMER21_SHUTDOWN_TASK 0                      /*!< (unspecified)                                                        */

#define TIMER22_CC_NUM_MIN 0                         /*!< (unspecified)                                                        */
#define TIMER22_CC_NUM_MAX 5                         /*!< (unspecified)                                                        */
#define TIMER22_CC_NUM_SIZE 6                        /*!< (unspecified)                                                        */
#define TIMER22_MAX_SIZE_MIN 0                       /*!< (unspecified)                                                        */
#define TIMER22_MAX_SIZE_MAX 31                      /*!< (unspecified)                                                        */
#define TIMER22_MAX_SIZE_SIZE 32                     /*!< (unspecified)                                                        */
#define TIMER22_PCLK_MHZ 16                          /*!< Peripheral clock frequency (PCLK) is 16 MHz                          */
#define TIMER22_PCLK_VARIABLE 0                      /*!< (unspecified)                                                        */
#define TIMER22_SHUTDOWN_TASK 0                      /*!< (unspecified)                                                        */

